#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/d74736f1-90bb-4535-a2f2-2cd0cd245d17/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["another-prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "another-prod-project-98jp"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "central-gcp-vpc-non-prod-37070"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "my-new-project-trw0"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["net-shared-vpc-prod"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "net-shared-vpc-prod-a72t"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-id"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:410553540498@cloudservices.gserviceaccount.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-02"
    }

  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prod-project-369617"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["prod-project"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:638944924927@cloudservices.gserviceaccount.com"
      + project    = "net-shared-vpc-prod-a72t"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-us-central1-10-10-20-0-24"
    }

  # module.project-factory["prod-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
        id                  = "projects/prod-project-369617"
      ~ labels              = {
          + "label" = "test1"
        }
        name                = "prod-project"
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 2 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["another-prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "another-prod-project-98jp"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "central-gcp-vpc-non-prod-37070"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "my-new-project-trw0"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "net-shared-vpc-prod-a72t"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-id"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created%0A  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + member     = "serviceAccount:410553540498@cloudservices.gserviceaccount.com"%0A      + project    = "central-gcp-vpc-non-prod-37070"%0A      + region     = "us-central1"%0A      + role       = "roles/compute.networkUser"%0A      + subnetwork = "subnet-02"%0A    }%0A%0A  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "prod-project-369617"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["prod-project"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created%0A  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + member     = "serviceAccount:638944924927@cloudservices.gserviceaccount.com"%0A      + project    = "net-shared-vpc-prod-a72t"%0A      + region     = "us-central1"%0A      + role       = "roles/compute.networkUser"%0A      + subnetwork = "subnet-us-central1-10-10-20-0-24"%0A    }%0A%0A  # module.project-factory["prod-project"].module.project-factory.google_project.main will be updated in-place%0A  ~ resource "google_project" "main" {%0A        id                  = "projects/prod-project-369617"%0A      ~ labels              = {%0A          + "label" = "test1"%0A        }%0A        name                = "prod-project"%0A        # (5 unchanged attributes hidden)%0A%0A      - timeouts {}%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @token-generator-pull-request[bot], Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*